{
    "version": "https://jsonfeed.org/version/1",
    "title": "TechnoNauts.In",
    "description": "",
    "home_page_url": "https://mydoom2010.github.io/TechnoNauts",
    "feed_url": "https://mydoom2010.github.io/TechnoNauts/feed.json",
    "user_comment": "",
    "author": {
        "name": "M.J"
    },
    "items": [
        {
            "id": "https://mydoom2010.github.io/TechnoNauts/enigma-code-breaking-machine-rebuilt-at-cambridge.html",
            "url": "https://mydoom2010.github.io/TechnoNauts/enigma-code-breaking-machine-rebuilt-at-cambridge.html",
            "title": "Enigma Code-Breaking Machine Rebuilt At Cambridge ",
            "summary": "Work on the hardware-based replica began in 2018, as part of Hal's fourth year Master's project under the supervision of King's College Fellow and Senior Tutor Dr. Tim Flack. The aim was to investigate further into cryptologist Marian Rejewski's cyclometer -- an early forerunner to&hellip;",
            "content_html": "<p><i>Work on the hardware-based replica began in 2018, as part of Hal's fourth year Master's project under the supervision of King's College Fellow and Senior Tutor Dr. Tim Flack. The aim was to investigate further into cryptologist Marian Rejewski's cyclometer -- an early forerunner to Cambridge University mathematician Alan Turing's machine, known as the Bombe, which was used to crack the German Enigma code during the Second World War. Hal said he chose to work on the cyclometer as it was the very first machine used to assist the decryption effort. To his knowledge, the replica is the first fully-functioning hardware-based electromechanical cyclometer to exist since the years preceding the Second World War. The original machines would have been destroyed in 1939 to prevent them from falling into the hands of German invaders. <br><br>Rejewski's cyclometer exploited the German's procedure at the time of double encipherment of the Enigma message key, and semi-automated the process for calculating what were known as 'characteristics' for every possible Enigma rotor starting position. There were more than 100,000 of these rotor starting positions, and they each needed their characteristic to be calculated and catalogued in a card index system. The cyclometer therefore eliminated the arduous task of calculating these characteristics by hand. The machine consisted of, in effect, two interlinked Enigma systems side-by-side -- one offset by three positions relative to the other -- and 26 lamps and switches to cover the alphabet. On operation, a certain number of bulbs illuminated, indicating the lengths of the characteristics. These were recorded for every single possible rotor starting position to create an immense look-up catalogue. Once this was completed, obtaining the daily Enigma rotor starting settings to decode messages was a simple matter of intercepting enough messages and referencing the catalogue, taking only a matter of minutes. </i></p>",
            "author": {
                "name": "M.J"
            },
            "tags": [
            ],
            "date_published": "2020-07-17T18:38:03+05:30",
            "date_modified": "2020-07-17T18:38:03+05:30"
        }
    ]
}
